name: "DEPLOY_P3D_RESNET_SPORTS1M"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param {
    shape {
	  dim: 1
	  dim: 3
	  dim: 16
	  dim: 160
	  dim: 160
	}
  }
}
#----------------------------p3d layers------------------------------
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 64
    bias_term: false
    pad: 0
    pad: 3
    pad: 3
    kernel_size: 1
    kernel_size: 7
    kernel_size: 7
    stride: 1
    stride: 2
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }

  }
}
layer {
  name: "bn_conv1"
  type: "BN"
  bottom: "conv1"
  top: "bn_conv1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: false
  }
}
layer {
  name: "conv1_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "bn_conv1"
  top: "bn_conv1"
}
layer {
  name: "pool1"
  type: "Pooling3D"
  bottom: "bn_conv1"
  top: "pool1"
  pooling3d_param {
    pool: MAX
    pad: 0
    kernel_size: 3
    stride: 2
    pad_l: 0
    kernel_l: 2
    stride_l: 2
  }
}
layer {
  name: "res2a_branch1"
  type: "Convolution"
  bottom: "pool1"
  top: "res2a_branch1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 256
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn2a_branch1"
  type: "BN"
  bottom: "res2a_branch1"
  top: "bn2a_branch1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res2a_branch2a"
  type: "Convolution"
  bottom: "pool1"
  top: "res2a_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 64
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn2a_branch2a"
  type: "BN"
  bottom: "res2a_branch2a"
  top: "bn2a_branch2a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res2a_branch2a_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "bn2a_branch2a"
  top: "bn2a_branch2a"
}
layer {
  name: "res2a_branch2b"
  type: "Convolution"
  bottom: "bn2a_branch2a"
  top: "res2a_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 64
    bias_term: false
    pad: 0
    pad: 1
    pad: 1
    kernel_size: 1
    kernel_size: 3
    kernel_size: 3
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn2a_branch2b"
  type: "BN"
  bottom: "res2a_branch2b"
  top: "bn2a_branch2b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res2a_branch2b_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "bn2a_branch2b"
  top: "bn2a_branch2b"
}
layer {
  name: "res2a_branch2b_t"
  type: "Convolution"
  bottom: "bn2a_branch2b"
  top: "res2a_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 64
    bias_term: false
    pad: 1
    pad: 0
    pad: 0
    kernel_size: 3
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn2a_branch2b_t"
  type: "BN"
  bottom: "res2a_branch2b_t"
  top: "bn2a_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res2a_branch2b_t_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "bn2a_branch2b_t"
  top: "bn2a_branch2b_t"
}
layer {
  name: "res2a_branch2c"
  type: "Convolution"
  bottom: "bn2a_branch2b_t"
  top: "res2a_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 256
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn2a_branch2c"
  type: "BN"
  bottom: "res2a_branch2c"
  top: "bn2a_branch2c"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res2a"
  type: "Eltwise"
  bottom: "bn2a_branch1"
  bottom: "bn2a_branch2c"
  top: "res2a"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res2a_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "res2a"
  top: "res2a"
}
layer {
  name: "res2b_branch2a"
  type: "Convolution"
  bottom: "res2a"
  top: "res2b_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 64
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn2b_branch2a"
  type: "BN"
  bottom: "res2b_branch2a"
  top: "bn2b_branch2a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res2b_branch2a_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "bn2b_branch2a"
  top: "bn2b_branch2a"
}
layer {
  name: "res2b_branch2b"
  type: "Convolution"
  bottom: "bn2b_branch2a"
  top: "res2b_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 64
    bias_term: false
    pad: 0
    pad: 1
    pad: 1
    kernel_size: 1
    kernel_size: 3
    kernel_size: 3
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn2b_branch2b"
  type: "BN"
  bottom: "res2b_branch2b"
  top: "bn2b_branch2b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res2b_branch2b_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "bn2b_branch2b"
  top: "bn2b_branch2b"
}
layer {
  name: "res2b_branch2b_t"
  type: "Convolution"
  bottom: "bn2b_branch2a"
  top: "res2b_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 64
    bias_term: false
    pad: 1
    pad: 0
    pad: 0
    kernel_size: 3
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn2b_branch2b_t"
  type: "BN"
  bottom: "res2b_branch2b_t"
  top: "bn2b_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res2b_branch2b_st"
  type: "Eltwise"
  bottom: "bn2b_branch2b"
  bottom: "bn2b_branch2b_t"
  top: "res2b_branch2b_st"
  eltwise_param {
    operation: SUM
    coeff: 1
    coeff: 1
  }
}
layer {
  name: "res2b_branch2b_st_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "res2b_branch2b_st"
  top: "res2b_branch2b_st"
}
layer {
  name: "res2b_branch2c"
  type: "Convolution"
  bottom: "res2b_branch2b_st"
  top: "res2b_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 256
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn2b_branch2c"
  type: "BN"
  bottom: "res2b_branch2c"
  top: "bn2b_branch2c"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res2b"
  type: "Eltwise"
  bottom: "res2a"
  bottom: "bn2b_branch2c"
  top: "res2b"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res2b_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "res2b"
  top: "res2b"
}
layer {
  name: "res2c_branch2a"
  type: "Convolution"
  bottom: "res2b"
  top: "res2c_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 64
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn2c_branch2a"
  type: "BN"
  bottom: "res2c_branch2a"
  top: "bn2c_branch2a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res2c_branch2a_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "bn2c_branch2a"
  top: "bn2c_branch2a"
}
layer {
  name: "res2c_branch2b"
  type: "Convolution"
  bottom: "bn2c_branch2a"
  top: "res2c_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 64
    bias_term: false
    pad: 0
    pad: 1
    pad: 1
    kernel_size: 1
    kernel_size: 3
    kernel_size: 3
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn2c_branch2b"
  type: "BN"
  bottom: "res2c_branch2b"
  top: "bn2c_branch2b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res2c_branch2b_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "bn2c_branch2b"
  top: "bn2c_branch2b"
}
layer {
  name: "res2c_branch2b_t"
  type: "Convolution"
  bottom: "bn2c_branch2b"
  top: "res2c_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 64
    bias_term: false
    pad: 1
    pad: 0
    pad: 0
    kernel_size: 3
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn2c_branch2b_t"
  type: "BN"
  bottom: "res2c_branch2b_t"
  top: "bn2c_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res2c_branch2b_st"
  type: "Eltwise"
  bottom: "bn2c_branch2b"
  bottom: "bn2c_branch2b_t"
  top: "res2c_branch2b_st"
  eltwise_param {
    operation: SUM
    coeff: 0.5
    coeff: 0.5
  }
}
layer {
  name: "res2c_branch2b_st_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "res2c_branch2b_st"
  top: "res2c_branch2b_st"
}
layer {
  name: "res2c_branch2c"
  type: "Convolution"
  bottom: "res2c_branch2b_st"
  top: "res2c_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 256
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn2c_branch2c"
  type: "BN"
  bottom: "res2c_branch2c"
  top: "bn2c_branch2c"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res2c"
  type: "Eltwise"
  bottom: "res2b"
  bottom: "bn2c_branch2c"
  top: "res2c"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res2c_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "res2c"
  top: "res2c"
}
layer {
  name: "3a_pool"
  type: "Pooling3D"
  bottom: "res2c"
  top: "3a_pool"
  pooling3d_param {
    pool: MAX
    pad: 0
    kernel_size: 1
    stride: 1
    pad_l: 0
    kernel_l: 2
    stride_l: 2
  }
}
layer {
  name: "res3a_branch1"
  type: "Convolution"
  bottom: "3a_pool"
  top: "res3a_branch1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 2
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3a_branch1"
  type: "BN"
  bottom: "res3a_branch1"
  top: "bn3a_branch1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3a_branch2a"
  type: "Convolution"
  bottom: "3a_pool"
  top: "res3a_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 2
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3a_branch2a"
  type: "BN"
  bottom: "res3a_branch2a"
  top: "bn3a_branch2a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3a_branch2a_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "bn3a_branch2a"
  top: "bn3a_branch2a"
}
layer {
  name: "res3a_branch2b"
  type: "Convolution"
  bottom: "bn3a_branch2a"
  top: "res3a_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 0
    pad: 1
    pad: 1
    kernel_size: 1
    kernel_size: 3
    kernel_size: 3
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3a_branch2b"
  type: "BN"
  bottom: "res3a_branch2b"
  top: "bn3a_branch2b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3a_branch2b_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "bn3a_branch2b"
  top: "bn3a_branch2b"
}
layer {
  name: "res3a_branch2b_t"
  type: "Convolution"
  bottom: "bn3a_branch2b"
  top: "res3a_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 1
    pad: 0
    pad: 0
    kernel_size: 3
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3a_branch2b_t"
  type: "BN"
  bottom: "res3a_branch2b_t"
  top: "bn3a_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3a_branch2b_t_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "bn3a_branch2b_t"
  top: "bn3a_branch2b_t"
}
layer {
  name: "res3a_branch2c"
  type: "Convolution"
  bottom: "bn3a_branch2b_t"
  top: "res3a_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3a_branch2c"
  type: "BN"
  bottom: "res3a_branch2c"
  top: "bn3a_branch2c"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3a"
  type: "Eltwise"
  bottom: "bn3a_branch1"
  bottom: "bn3a_branch2c"
  top: "res3a"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res3a_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "res3a"
  top: "res3a"
}
layer {
  name: "res3b1_branch2a"
  type: "Convolution"
  bottom: "res3a"
  top: "res3b1_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b1_branch2a"
  type: "BN"
  bottom: "res3b1_branch2a"
  top: "bn3b1_branch2a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b1_branch2a_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "bn3b1_branch2a"
  top: "bn3b1_branch2a"
}
layer {
  name: "res3b1_branch2b"
  type: "Convolution"
  bottom: "bn3b1_branch2a"
  top: "res3b1_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 0
    pad: 1
    pad: 1
    kernel_size: 1
    kernel_size: 3
    kernel_size: 3
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b1_branch2b"
  type: "BN"
  bottom: "res3b1_branch2b"
  top: "bn3b1_branch2b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b1_branch2b_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "bn3b1_branch2b"
  top: "bn3b1_branch2b"
}
layer {
  name: "res3b1_branch2b_t"
  type: "Convolution"
  bottom: "bn3b1_branch2a"
  top: "res3b1_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 1
    pad: 0
    pad: 0
    kernel_size: 3
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b1_branch2b_t"
  type: "BN"
  bottom: "res3b1_branch2b_t"
  top: "bn3b1_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b1_branch2b_st"
  type: "Eltwise"
  bottom: "bn3b1_branch2b"
  bottom: "bn3b1_branch2b_t"
  top: "res3b1_branch2b_st"
  eltwise_param {
    operation: SUM
    coeff: 1
    coeff: 1
  }
}
layer {
  name: "res3b1_branch2b_st_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "res3b1_branch2b_st"
  top: "res3b1_branch2b_st"
}
layer {
  name: "res3b1_branch2c"
  type: "Convolution"
  bottom: "res3b1_branch2b_st"
  top: "res3b1_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b1_branch2c"
  type: "BN"
  bottom: "res3b1_branch2c"
  top: "bn3b1_branch2c"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b1"
  type: "Eltwise"
  bottom: "res3a"
  bottom: "bn3b1_branch2c"
  top: "res3b1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res3b1_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "res3b1"
  top: "res3b1"
}
layer {
  name: "res3b2_branch2a"
  type: "Convolution"
  bottom: "res3b1"
  top: "res3b2_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b2_branch2a"
  type: "BN"
  bottom: "res3b2_branch2a"
  top: "bn3b2_branch2a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b2_branch2a_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "bn3b2_branch2a"
  top: "bn3b2_branch2a"
}
layer {
  name: "res3b2_branch2b"
  type: "Convolution"
  bottom: "bn3b2_branch2a"
  top: "res3b2_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 0
    pad: 1
    pad: 1
    kernel_size: 1
    kernel_size: 3
    kernel_size: 3
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b2_branch2b"
  type: "BN"
  bottom: "res3b2_branch2b"
  top: "bn3b2_branch2b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b2_branch2b_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "bn3b2_branch2b"
  top: "bn3b2_branch2b"
}
layer {
  name: "res3b2_branch2b_t"
  type: "Convolution"
  bottom: "bn3b2_branch2b"
  top: "res3b2_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 1
    pad: 0
    pad: 0
    kernel_size: 3
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b2_branch2b_t"
  type: "BN"
  bottom: "res3b2_branch2b_t"
  top: "bn3b2_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b2_branch2b_st"
  type: "Eltwise"
  bottom: "bn3b2_branch2b"
  bottom: "bn3b2_branch2b_t"
  top: "res3b2_branch2b_st"
  eltwise_param {
    operation: SUM
    coeff: 0.5
    coeff: 0.5
  }
}
layer {
  name: "res3b2_branch2b_st_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "res3b2_branch2b_st"
  top: "res3b2_branch2b_st"
}
layer {
  name: "res3b2_branch2c"
  type: "Convolution"
  bottom: "res3b2_branch2b_st"
  top: "res3b2_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b2_branch2c"
  type: "BN"
  bottom: "res3b2_branch2c"
  top: "bn3b2_branch2c"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b2"
  type: "Eltwise"
  bottom: "res3b1"
  bottom: "bn3b2_branch2c"
  top: "res3b2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res3b2_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "res3b2"
  top: "res3b2"
}
layer {
  name: "res3b3_branch2a"
  type: "Convolution"
  bottom: "res3b2"
  top: "res3b3_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b3_branch2a"
  type: "BN"
  bottom: "res3b3_branch2a"
  top: "bn3b3_branch2a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b3_branch2a_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "bn3b3_branch2a"
  top: "bn3b3_branch2a"
}
layer {
  name: "res3b3_branch2b"
  type: "Convolution"
  bottom: "bn3b3_branch2a"
  top: "res3b3_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 0
    pad: 1
    pad: 1
    kernel_size: 1
    kernel_size: 3
    kernel_size: 3
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b3_branch2b"
  type: "BN"
  bottom: "res3b3_branch2b"
  top: "bn3b3_branch2b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b3_branch2b_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "bn3b3_branch2b"
  top: "bn3b3_branch2b"
}
layer {
  name: "res3b3_branch2b_t"
  type: "Convolution"
  bottom: "bn3b3_branch2b"
  top: "res3b3_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 1
    pad: 0
    pad: 0
    kernel_size: 3
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b3_branch2b_t"
  type: "BN"
  bottom: "res3b3_branch2b_t"
  top: "bn3b3_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b3_branch2b_t_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "bn3b3_branch2b_t"
  top: "bn3b3_branch2b_t"
}
layer {
  name: "res3b3_branch2c"
  type: "Convolution"
  bottom: "bn3b3_branch2b_t"
  top: "res3b3_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b3_branch2c"
  type: "BN"
  bottom: "res3b3_branch2c"
  top: "bn3b3_branch2c"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b3"
  type: "Eltwise"
  bottom: "res3b2"
  bottom: "bn3b3_branch2c"
  top: "res3b3"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res3b3_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "res3b3"
  top: "res3b3"
}
layer {
  name: "res3b4_branch2a"
  type: "Convolution"
  bottom: "res3b3"
  top: "res3b4_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b4_branch2a"
  type: "BN"
  bottom: "res3b4_branch2a"
  top: "bn3b4_branch2a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b4_branch2a_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "bn3b4_branch2a"
  top: "bn3b4_branch2a"
}
layer {
  name: "res3b4_branch2b"
  type: "Convolution"
  bottom: "bn3b4_branch2a"
  top: "res3b4_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 0
    pad: 1
    pad: 1
    kernel_size: 1
    kernel_size: 3
    kernel_size: 3
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b4_branch2b"
  type: "BN"
  bottom: "res3b4_branch2b"
  top: "bn3b4_branch2b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b4_branch2b_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "bn3b4_branch2b"
  top: "bn3b4_branch2b"
}
layer {
  name: "res3b4_branch2b_t"
  type: "Convolution"
  bottom: "bn3b4_branch2a"
  top: "res3b4_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 1
    pad: 0
    pad: 0
    kernel_size: 3
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b4_branch2b_t"
  type: "BN"
  bottom: "res3b4_branch2b_t"
  top: "bn3b4_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b4_branch2b_st"
  type: "Eltwise"
  bottom: "bn3b4_branch2b"
  bottom: "bn3b4_branch2b_t"
  top: "res3b4_branch2b_st"
  eltwise_param {
    operation: SUM
    coeff: 1
    coeff: 1
  }
}
layer {
  name: "res3b4_branch2b_st_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "res3b4_branch2b_st"
  top: "res3b4_branch2b_st"
}
layer {
  name: "res3b4_branch2c"
  type: "Convolution"
  bottom: "res3b4_branch2b_st"
  top: "res3b4_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b4_branch2c"
  type: "BN"
  bottom: "res3b4_branch2c"
  top: "bn3b4_branch2c"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b4"
  type: "Eltwise"
  bottom: "res3b3"
  bottom: "bn3b4_branch2c"
  top: "res3b4"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res3b4_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "res3b4"
  top: "res3b4"
}
layer {
  name: "res3b5_branch2a"
  type: "Convolution"
  bottom: "res3b4"
  top: "res3b5_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b5_branch2a"
  type: "BN"
  bottom: "res3b5_branch2a"
  top: "bn3b5_branch2a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b5_branch2a_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "bn3b5_branch2a"
  top: "bn3b5_branch2a"
}
layer {
  name: "res3b5_branch2b"
  type: "Convolution"
  bottom: "bn3b5_branch2a"
  top: "res3b5_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 0
    pad: 1
    pad: 1
    kernel_size: 1
    kernel_size: 3
    kernel_size: 3
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b5_branch2b"
  type: "BN"
  bottom: "res3b5_branch2b"
  top: "bn3b5_branch2b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b5_branch2b_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "bn3b5_branch2b"
  top: "bn3b5_branch2b"
}
layer {
  name: "res3b5_branch2b_t"
  type: "Convolution"
  bottom: "bn3b5_branch2b"
  top: "res3b5_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 1
    pad: 0
    pad: 0
    kernel_size: 3
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b5_branch2b_t"
  type: "BN"
  bottom: "res3b5_branch2b_t"
  top: "bn3b5_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b5_branch2b_st"
  type: "Eltwise"
  bottom: "bn3b5_branch2b"
  bottom: "bn3b5_branch2b_t"
  top: "res3b5_branch2b_st"
  eltwise_param {
    operation: SUM
    coeff: 0.5
    coeff: 0.5
  }
}
layer {
  name: "res3b5_branch2b_st_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "res3b5_branch2b_st"
  top: "res3b5_branch2b_st"
}
layer {
  name: "res3b5_branch2c"
  type: "Convolution"
  bottom: "res3b5_branch2b_st"
  top: "res3b5_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b5_branch2c"
  type: "BN"
  bottom: "res3b5_branch2c"
  top: "bn3b5_branch2c"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b5"
  type: "Eltwise"
  bottom: "res3b4"
  bottom: "bn3b5_branch2c"
  top: "res3b5"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res3b5_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "res3b5"
  top: "res3b5"
}
layer {
  name: "res3b6_branch2a"
  type: "Convolution"
  bottom: "res3b5"
  top: "res3b6_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b6_branch2a"
  type: "BN"
  bottom: "res3b6_branch2a"
  top: "bn3b6_branch2a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b6_branch2a_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "bn3b6_branch2a"
  top: "bn3b6_branch2a"
}
layer {
  name: "res3b6_branch2b"
  type: "Convolution"
  bottom: "bn3b6_branch2a"
  top: "res3b6_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 0
    pad: 1
    pad: 1
    kernel_size: 1
    kernel_size: 3
    kernel_size: 3
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b6_branch2b"
  type: "BN"
  bottom: "res3b6_branch2b"
  top: "bn3b6_branch2b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b6_branch2b_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "bn3b6_branch2b"
  top: "bn3b6_branch2b"
}
layer {
  name: "res3b6_branch2b_t"
  type: "Convolution"
  bottom: "bn3b6_branch2b"
  top: "res3b6_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 1
    pad: 0
    pad: 0
    kernel_size: 3
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b6_branch2b_t"
  type: "BN"
  bottom: "res3b6_branch2b_t"
  top: "bn3b6_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b6_branch2b_t_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "bn3b6_branch2b_t"
  top: "bn3b6_branch2b_t"
}
layer {
  name: "res3b6_branch2c"
  type: "Convolution"
  bottom: "bn3b6_branch2b_t"
  top: "res3b6_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b6_branch2c"
  type: "BN"
  bottom: "res3b6_branch2c"
  top: "bn3b6_branch2c"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b6"
  type: "Eltwise"
  bottom: "res3b5"
  bottom: "bn3b6_branch2c"
  top: "res3b6"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res3b6_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "res3b6"
  top: "res3b6"
}
layer {
  name: "res3b7_branch2a"
  type: "Convolution"
  bottom: "res3b6"
  top: "res3b7_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b7_branch2a"
  type: "BN"
  bottom: "res3b7_branch2a"
  top: "bn3b7_branch2a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b7_branch2a_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "bn3b7_branch2a"
  top: "bn3b7_branch2a"
}
layer {
  name: "res3b7_branch2b"
  type: "Convolution"
  bottom: "bn3b7_branch2a"
  top: "res3b7_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 0
    pad: 1
    pad: 1
    kernel_size: 1
    kernel_size: 3
    kernel_size: 3
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b7_branch2b"
  type: "BN"
  bottom: "res3b7_branch2b"
  top: "bn3b7_branch2b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b7_branch2b_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "bn3b7_branch2b"
  top: "bn3b7_branch2b"
}
layer {
  name: "res3b7_branch2b_t"
  type: "Convolution"
  bottom: "bn3b7_branch2a"
  top: "res3b7_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 1
    pad: 0
    pad: 0
    kernel_size: 3
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b7_branch2b_t"
  type: "BN"
  bottom: "res3b7_branch2b_t"
  top: "bn3b7_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b7_branch2b_st"
  type: "Eltwise"
  bottom: "bn3b7_branch2b"
  bottom: "bn3b7_branch2b_t"
  top: "res3b7_branch2b_st"
  eltwise_param {
    operation: SUM
    coeff: 1
    coeff: 1
  }
}
layer {
  name: "res3b7_branch2b_st_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "res3b7_branch2b_st"
  top: "res3b7_branch2b_st"
}
layer {
  name: "res3b7_branch2c"
  type: "Convolution"
  bottom: "res3b7_branch2b_st"
  top: "res3b7_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
  }
}
layer {
  name: "bn3b7_branch2c"
  type: "BN"
  bottom: "res3b7_branch2c"
  top: "bn3b7_branch2c"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "res3b7"
  type: "Eltwise"
  bottom: "res3b6"
  bottom: "bn3b7_branch2c"
  top: "res3b7"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res3b7_relu"
  type: "ReLU"
  relu_param {
    engine:CAFFE
  }
  bottom: "res3b7"
  top: "res3b7"
}
layer {
  name: "4a_pool"
  type: "Pooling3D"
  bottom: "res3b7"
  top: "4a_pool"
  pooling3d_param {
    pool: MAX
    pad: 0
    kernel_size: 1
    stride: 1
    pad_l: 0
    kernel_l: 2
